JFiore31/ME461_repo/C2000Ware_4_01_00_00/device_support/f2802x/f28027_ls7366/f28027_enc_and_imu.c
    EPwm4Regs.ETSEL.bit.SOCAEN = 0; // Disable SOC on A group
    EPwm4Regs.TBCTL.bit.CTRMODE = 3; // freeze counter
    EPwm4Regs.ETSEL.bit.SOCASEL = 2; // Select Event when counter equal to PRD
    EPwm4Regs.ETPS.bit.SOCAPRD = 1; // Generate pulse on 1st event (“pulse� is the same as “trigger�)
    EPwm4Regs.TBCTR = 0x0; // Clear counter
    EPwm4Regs.TBCTL.bit.PHSEN = 0; // Disable phase loading
    EPwm4Regs.TBCTL.bit.CLKDIV = 0; // divide by 1  50Mhz Clock
    EPwm4Regs.TBPRD = 30000/10;  //10000Hz,  Input clock is 30MHz.  60Mhz/2
    EPwm4Regs.ETSEL.bit.SOCAEN = 1; //enable SOCA
    EPwm4Regs.TBCTL.bit.CTRMODE = 0; //unfreeze, and enter up count mode



    EALLOW;
    GpioCtrlRegs.GPAPUD.bit.GPIO2 = 1;    // Disable pull-up on GPIO2 (EPWM2A)
    GpioCtrlRegs.GPAMUX1.bit.GPIO2 = 1;   // Configure GPIO2 as EPWM2A

    GpioCtrlRegs.GPAPUD.bit.GPIO3 = 1;    // Disable pull-up on GPIO3 (EPWM2B)
    GpioCtrlRegs.GPAMUX1.bit.GPIO3 = 1;   // Configure GPIO3 as EPWM2B
    EDIS;

    EPwm2Regs.TBCTL.bit.CTRMODE = 0;      //set epwm2 to upcount mode
    EPwm2Regs.TBCTL.bit.FREE_SOFT = 0x2;  //Free Run
    EPwm2Regs.TBCTL.bit.CLKDIV = 4;  // Divide by 16
    EPwm2Regs.TBPRD = 37500; //set epwm2 counter  50Hz
    EPwm2Regs.TBCTL.bit.PHSEN = 0;    // Disable phase loading
    EPwm2Regs.TBCTR = 0x0000;                  // Clear counter
    EPwm2Regs.AQCTLA.bit.CAU = AQ_CLEAR;        //clear when counter = compareA
    EPwm2Regs.AQCTLA.bit.ZRO = AQ_SET;          //set when timer is 0
    EPwm2Regs.AQCTLB.bit.CBU = AQ_CLEAR;            // Clear when counter = compareB
    EPwm2Regs.AQCTLB.bit.ZRO = AQ_SET;              // Set when timer is 0
    EPwm2Regs.CMPA.half.CMPA = 3000;
    EPwm2Regs.CMPB = 3000;

    EALLOW;
    //    GpioCtrlRegs.GPAPUD.bit.GPIO4 = 1;    // Disable pull-up on GPIO4 (EPWM3A)
    //    GpioCtrlRegs.GPAMUX1.bit.GPIO4 = 0;   // Configure GPIO4 as EPWM3A
    //    GpioDataRegs.GPACLEAR.bit.GPIO4 = 1;
    //    GpioCtrlRegs.GPADIR.bit.GPIO4 = 1;
    //    GpioCtrlRegs.GPBPUD.bit.GPIO4 = 1;

    //GpioCtrlRegs.GPAPUD.bit.GPIO5 = 1;    // Disable pull-up on GPIO5 (EPWM3B)
    //GpioCtrlRegs.GPAMUX1.bit.GPIO5 = 1;   // Configure GPIO5 as EPWM3B

    GpioCtrlRegs.GPAPUD.bit.GPIO5 = 1;    // Disable pull-up on GPIO5 (EPWM3B)
    GpioCtrlRegs.GPAMUX1.bit.GPIO5 = 0;   // Configure GPIO5 as EPWM3B
    GpioCtrlRegs.GPADIR.bit.GPIO5 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO5 = 1;
    EDIS;
    //
    //    EPwm3Regs.TBCTL.bit.CTRMODE = 0;      //set epwm3 to upcount mode
    //    EPwm3Regs.TBCTL.bit.FREE_SOFT = 0x2;  //Free Run
    //    EPwm3Regs.TBCTL.bit.CLKDIV = 4;   // Divide by 16
    //    EPwm3Regs.TBPRD = 37500; //set epwm3 counter  50Hz
    //    EPwm3Regs.TBCTL.bit.PHSEN = 0;    // Disable phase loading
    //    EPwm3Regs.TBCTR = 0x0000;                  // Clear counter
    //    EPwm3Regs.AQCTLA.bit.CAU = AQ_CLEAR;        //clear when counter = compareA
    //    EPwm3Regs.AQCTLA.bit.ZRO = AQ_SET;          //set when timer is 0
    //    EPwm3Regs.AQCTLB.bit.CBU = AQ_CLEAR;            // Clear when counter = compareB
    //    EPwm3Regs.AQCTLB.bit.ZRO = AQ_SET;              // Set when timer is 0
    //    EPwm3Regs.CMPA.half.CMPA = 3000;
    //    EPwm3Regs.CMPB = 3000;
    //



    //
    // Enable CPU int1 which is connected to CPU-Timer 0, CPU int13
    // which is connected to CPU-Timer 1, and CPU int 14, which is connected
    // to CPU-Timer 2:
    //
    IER |= M_INT1;
    IER |= M_INT13;
    IER |= M_INT14;
    IER |= M_INT9;  // SCIA
    IER |= M_INT6; // spia


    //    PieCtrlRegs.PIEIER1.bit.INTx1 = 1; // Enable INT 1.1 ADCA1
    //
    // Enable TINT0 in the PIE: Group 1 interrupt 7
    //
    PieCtrlRegs.PIEIER1.bit.INTx7 = 1;

    EALLOW;
    GpioCtrlRegs.GPBMUX1.bit.GPIO34 = 0;
    GpioDataRegs.GPBCLEAR.bit.GPIO34 = 1;
    GpioCtrlRegs.GPBDIR.bit.GPIO34 = 1;
    GpioCtrlRegs.GPBPUD.bit.GPIO34 = 1;
    EDIS;

    SpiaRegs.SPIFFRX.bit.RXFFOVFCLR=1;  // Clear Overflow flag
    SpiaRegs.SPIFFRX.bit.RXFFINTCLR=1;  // Clear Interrupt flag
    //    SpiaRegs.SPICCR.bit.SPICHAR      = 0xF;  // Set to transmit 16 bits
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP6;   // Acknowledge interrupt to PIE


    //
    // Enable global Interrupts and higher priority real-time debug events
    //
    EINT;           // Enable Global interrupt INTM
    ERTM;           // Enable Global realtime interrupt DBGM

    // IDLE loop. Just sit and loop forever (optional):
    while(1)
    {
        if (RunPingFFT == 1) {
            //            GpioDataRegs.GPASET.bit.GPIO4 = 1;
            RunPingFFT = 0;
            //Clean up input/output buffer
            for(i=0; i < (FFT_SIZE+2); i=i+2){
                ipcb[i]   = 0;
                ipcb[i+1] = 0;
            }
            RFFT32_brev(ipcbsrcping, ipcb, FFT_SIZE); // real FFT bit reversing

            rfft.ipcbptr = ipcb;                  // FFT computation buffer
            rfft.magptr  = ipcbsrcping;               // Magnitude output buffer
            rfft.winptr  = (long *)win;           // Window coefficient array
            rfft.init(&rfft);                     // Twiddle factor pointer initialization

            rfft.calc(&rfft);                     // Compute the FFT
            rfft.split(&rfft);                    // Post processing to get the correct spectrum
            rfft.mag(&rfft);                      // Q31 format (abs(ipcbsrc)/2^16).^2
            maxpwr = 0;
            maxpwrindex = 0;

            for (i=5;i<(FFT_SIZE/2);i++) {
                if (ipcbsrcping[i]>maxpwr) {
                    maxpwr = ipcbsrcping[i];
                    maxpwrindex = i;
                }
            }
            maxpwr_f = maxpwr/2147483648.0;
            //            GpioDataRegs.GPACLEAR.bit.GPIO4 = 1;
        }
        else if (RunPongFFT == 1) {
            //            GpioDataRegs.GPASET.bit.GPIO4 = 1;
            RunPongFFT = 0;
            //Clean up input/output buffer
            for(i=0; i < (FFT_SIZE+2); i=i+2){
                ipcb[i]   = 0;
                ipcb[i+1] = 0;
            }
            RFFT32_brev(ipcbsrcpong, ipcb, FFT_SIZE); // real FFT bit reversing

            rfft.ipcbptr = ipcb;                  // FFT computation buffer
            rfft.magptr  = ipcbsrcpong;               // Magnitude output buffer
            rfft.winptr  = (long *)win;           // Window coefficient array
            rfft.init(&rfft);                     // Twiddle factor pointer initialization

