JFiore31/ME461_repo/C2000Ware_4_01_00_00/device_support/f2802x/f28027_ls7366/f28027_enc_and_imu.c
            rfft.calc(&rfft);                     // Compute the FFT
            rfft.split(&rfft);                    // Post processing to get the correct spectrum
            rfft.mag(&rfft);                      // Q31 format (abs(ipcbsrc)/2^16).^2
            maxpwr = 0;
            maxpwrindex = 0;

            for (i=5;i<(FFT_SIZE/2);i++) {
                if (ipcbsrcpong[i]>maxpwr) {
                    maxpwr = ipcbsrcpong[i];
                    maxpwrindex = i;
                }
            }
            maxpwr_f = maxpwr/2147483648.0;
            //            GpioDataRegs.GPACLEAR.bit.GPIO4 = 1;
        }

        if (UARTPrint == 1 ) {
            // serial_printf(&SerialA,"Pwr=%.3f,I=%d \r\n",maxpwr_f,maxpwrindex);
            serial_printf(&SerialA,"Ax=%d,Ay=%d,Az=%d,Gx=%d,Gy=%d,Gz=%d \r\n",AccelXraw,AccelYraw,AccelZraw,gyroXraw,gyroYraw,gyroZraw);
            UARTPrint = 0;
        }
    }
}

void setupSpia(void)        //for mpu9250
{
    EALLOW;
    GpioCtrlRegs.GPAPUD.bit.GPIO16 = 0;    // Enable pull-up on GPIO16 (SIMO)
    GpioCtrlRegs.GPAMUX2.bit.GPIO16 = 1;   // Configure GPIO16 as SIMO

    GpioCtrlRegs.GPAPUD.bit.GPIO17 = 0;    // Enable pull-up on GPIO17 (SOMI)
    GpioCtrlRegs.GPAMUX2.bit.GPIO17 = 1;   // Configure GPIO17 as SOMI

    GpioCtrlRegs.GPAPUD.bit.GPIO18 = 0;    // Enable pull-up on GPIO18 (CLK)
    GpioCtrlRegs.GPAMUX2.bit.GPIO18 = 1;   // Configure GPIO18 as CLK

    GpioCtrlRegs.GPAMUX2.bit.GPIO19 = 0;
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    GpioCtrlRegs.GPADIR.bit.GPIO19 = 1;
    GpioCtrlRegs.GPAPUD.bit.GPIO19 = 1;

    EDIS;

    EALLOW;
    GpioCtrlRegs.GPAQSEL2.bit.GPIO16 = 3; // Set I/O pin to asynchronous mode recommended for SPI
    GpioCtrlRegs.GPAQSEL2.bit.GPIO17 = 3; // Set I/O pin to asynchronous mode recommended for SPI
    GpioCtrlRegs.GPAQSEL2.bit.GPIO18 = 3; // Set I/O pin to asynchronous mode recommended for SPI
    EDIS;

    SpiaRegs.SPICCR.bit.SPISWRESET   = 0;    // Put SPI in Reset

    SpiaRegs.SPICTL.bit.CLK_PHASE    = 1;
    SpiaRegs.SPICCR.bit.CLKPOLARITY  = 0;

    SpiaRegs.SPICTL.bit.MASTER_SLAVE = 1;    // SPI master
    SpiaRegs.SPICCR.bit.SPICHAR      = 0xF;  // Set to transmit 16 bits
    SpiaRegs.SPICTL.bit.TALK         = 1;    // Enables transmission for the 4-pin option
    SpiaRegs.SPIPRI.bit.FREE         = 1;    // Free run, continue SPI operation
    SpiaRegs.SPICTL.bit.SPIINTENA    = 0;    // Disables the SPI interrupt

    SpiaRegs.SPIBRR = LSPCLK_HZ/1000000L - 1;

    SpiaRegs.SPISTS.all              = 0x0000;

    SpiaRegs.SPIFFTX.bit.SPIRST      = 1;    // SPI FIFO can resume transmit or receive.
    SpiaRegs.SPIFFTX.bit.SPIFFENA    = 1;    // SPI FIFO enhancements are enabled
    SpiaRegs.SPIFFTX.bit.TXFIFO      = 0;    // Write 0 to reset the FIFO pointer to zero, and hold in reset
    SpiaRegs.SPIFFTX.bit.TXFFINTCLR  = 1;    // Write 1 to clear SPIFFTX[TXFFINT] flag

    SpiaRegs.SPIFFRX.bit.RXFIFORESET = 0;    // Write 0 to reset the FIFO pointer to zero, and hold in reset
    SpiaRegs.SPIFFRX.bit.RXFFOVFCLR  = 1;    // Write 1 to clear SPIFFRX[RXFFOVF]
    SpiaRegs.SPIFFRX.bit.RXFFINTCLR  = 1;    // Write 1 to clear SPIFFRX[RXFFINT] flag
    SpiaRegs.SPIFFRX.bit.RXFFIENA    = 1;    // RX FIFO interrupt based on RXFFIL match

    SpiaRegs.SPIFFCT.bit.TXDLY       = 0; // The next word in the TX FIFO buffer is transferred to SPITXBUF immediately upon completion of transmission of the previous word.

    SpiaRegs.SPICCR.bit.SPISWRESET   = 1;    // Pull the SPI out of reset

    SpiaRegs.SPIFFTX.bit.TXFIFO      = 1;    // Release transmit FIFO from reset.
    SpiaRegs.SPIFFRX.bit.RXFIFORESET = 1;    // Re-enable receive FIFO operation
    SpiaRegs.SPICTL.bit.SPIINTENA    = 0;    // Disable the SPI interrupt.
    SpiaRegs.SPIFFRX.bit.RXFFIL      = 5;    // A RX FIFO interrupt request is generated when there are 1 or more words in the RX buffer.

    //-----------------------------------------------------------------------------------------------------------------

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (0x1300         | 0x00); // 0x1300 (0x0000)
    SpiaRegs.SPITXBUF = (0x0000         | 0x00); // 0x1400 (0x0000),       0x1500 (0x0000)
    SpiaRegs.SPITXBUF = (0x0000         | 0x00); // 0x1600 (0x0000),       0x1700 (0x0000)
    SpiaRegs.SPITXBUF = (0x0000         | 0x13); // 0x1800 (0x0000),       0x1900 (0x0013)

    while(SpiaRegs.SPIFFRX.bit.RXFFST !=4);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);
    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (0x1A00         | 0x02); //0x1A00 (0x0002),

    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);
    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (0x1B00         | 0x00); // 0x1B00 (0x0000), 250 dps
    SpiaRegs.SPITXBUF = (0x0800         | 0x06); // 0x1C00 (0x0008), +-4g, 0x1D00 (0x0006), 5Hz
    SpiaRegs.SPITXBUF = (0x0000         | 0x00); // 0x1E00 (0x0000),       0x1F00 (0x0000)

    while(SpiaRegs.SPIFFRX.bit.RXFFST !=3);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (FIFO_EN        | 0x0000); // 0x2300 (0x0000)
    SpiaRegs.SPITXBUF = (0x4000         | 0x008C); // 0x2400 (0x0040),       0x2500 (0x008C)
    SpiaRegs.SPITXBUF = (0x0200         | 0x0088); // 0x2600 (0x0002),       0x2700 (0x0088)
    SpiaRegs.SPITXBUF = (0x0C00         | 0x000A); // 0x2800 (0x000C),       0x2900 (0x000A)
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=4);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (I2C_SLV1_CTRL | 0x0081);  // 0x2A00 (0x0081)
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (INT_ENABLE | 0x0001);  // 0x3800
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (INT_STATUS | 0x0001);  // 0x3A00
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (I2C_SLV1_DO | 0x0001);  // 0x6400
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (I2C_MST_DELAY_CTRL | 0x0003); // 0x6700
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (USER_CTRL | 0x0020);  // 0x6A00
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (PWR_MGMT_1 | 0x0001); // 0x6B00
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (WHO_AM_I | 0x0071);  // 0x7500
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (XA_OFFSET_H | 0x00EB); // 0x7700
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (XA_OFFSET_L | 0x0012); // 0x7800
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (YA_OFFSET_H | 0x0018); // 0x7A00
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (YA_OFFSET_L | 0x0000); // 0x7B00
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (ZA_OFFSET_H | 0x0021); // 0x7D00
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (ZA_OFFSET_L | 0x0050); // 0x7E00
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    while(SpiaRegs.SPIFFRX.bit.RXFFST !=0){
        temp = SpiaRegs.SPIRXBUF;
    }

    SpiaRegs.SPICCR.bit.SPICHAR      = 0x7;  // Set to transmit 8 bits

    DELAY_US(50);
    EALLOW;
    GpioCtrlRegs.GPAMUX1.bit.GPIO4 = 0;
    GpioDataRegs.GPASET.bit.GPIO4 = 1;
    GpioCtrlRegs.GPADIR.bit.GPIO4 = 1;
    GpioCtrlRegs.GPAPUD.bit.GPIO4 = 1;

    GpioCtrlRegs.GPAMUX1.bit.GPIO6 = 0;
    GpioDataRegs.GPASET.bit.GPIO6 = 1;
    GpioCtrlRegs.GPADIR.bit.GPIO6 = 1;
    GpioCtrlRegs.GPAPUD.bit.GPIO6 = 1;
    EDIS;

    DELAY_US(1000);
    GpioDataRegs.GPACLEAR.bit.GPIO4 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO6 = 1;

    SpiaRegs.SPITXBUF = ((unsigned)0x20)<<8;  // CLR COUNT all four chips
    while (SpiaRegs.SPIFFRX.bit.RXFFST != 1) {}
    GpioDataRegs.GPASET.bit.GPIO4 = 1;
    GpioDataRegs.GPASET.bit.GPIO6 = 1;

