JFiore31/ME461_repo/C2000Ware_4_01_00_00/device_support/f2802x/f28027_ls7366/f28027_enc_and_imu.c
    temp = SpiaRegs.SPIRXBUF;


    GpioDataRegs.GPACLEAR.bit.GPIO4 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO6 = 1;
    SpiaRegs.SPITXBUF = ((unsigned)0x88)<<8;  // WR to MDR0
    SpiaRegs.SPITXBUF = ((unsigned)0x83)<<8;
    while (SpiaRegs.SPIFFRX.bit.RXFFST != 2) {}
    GpioDataRegs.GPASET.bit.GPIO4 = 1;
    GpioDataRegs.GPASET.bit.GPIO6 = 1;

    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;

    GpioDataRegs.GPACLEAR.bit.GPIO4 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO6 = 1;
    SpiaRegs.SPITXBUF = ((unsigned)0x90)<<8;  // WR MDR1
    SpiaRegs.SPITXBUF = 0x01<<8;
    while (SpiaRegs.SPIFFRX.bit.RXFFST != 2) {}
    GpioDataRegs.GPASET.bit.GPIO4 = 1;
    GpioDataRegs.GPASET.bit.GPIO6 = 1;

    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;

    SpiaRegs.SPICTL.bit.SPIINTENA = 0;
    SpiaRegs.SPIFFRX.bit.RXFFOVFCLR = 1;
    SpiaRegs.SPIFFRX.bit.RXFFINTCLR = 1;
    SpiaRegs.SPIFFRX.bit.RXFFIENA = 1;

    SpiaRegs.SPICCR.bit.SPICHAR      = 0xF;  // Set to transmit 16 bits
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP6;   // Acknowledge interrupt to PIE
    PieCtrlRegs.PIEIER6.bit.INTx1 = 1;  //Enable PIE 6.1 interrupt
}

void start_7366SPI(void) {
    SpiaRegs.SPICCR.bit.SPICHAR      = 0x7;  // Set to transmit 8 bits
    SpiaRegs.SPIFFRX.bit.RXFFIL = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO4 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO6 = 1;

    SpiaRegs.SPITXBUF = ((unsigned)0xE8)<<8; // Latch All ENCs
    SPIenc_state = 1;
}


__interrupt void adc_isr(void)
{
    ADC0raw = AdcResult.ADCRESULT0;
    microphone = ((float)((ADC0raw)/4096.0))*2147483648;
    if (pingpong == 0) {
        ipcbsrcping[fftsamplecount] = microphone;
        fftsamplecount++;
        if (fftsamplecount == FFT_SIZE) {
            fftsamplecount = 0;
            runpingfftcount = 0;
            RunPingFFT = 1;
            pingpong = 1;
        }
    } else {
        ipcbsrcpong[fftsamplecount] = microphone;
        fftsamplecount++;
        if (fftsamplecount == FFT_SIZE) {

            fftsamplecount = 0;
            runpingfftcount = 0;
            RunPongFFT = 1;
            pingpong = 0;
        }
    }



    ADCcount++;
    if ((ADCcount%500)==0) {
        GpioDataRegs.GPBTOGGLE.bit.GPIO34 = 1;
    }
    //
    // Clear ADCINT1 flag reinitialize for next SOC
    //
    AdcRegs.ADCINTFLGCLR.bit.ADCINT1 = 1;

    //
    // Acknowledge interrupt to PIE
    //
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;

}

void SPI_RXint(void) {
    uint16_t i;
    GpioDataRegs.GPASET.bit.GPIO5 = 1;
    switch (SPIenc_state) {
    case 1:
        GpioDataRegs.GPASET.bit.GPIO4 = 1;
        GpioDataRegs.GPASET.bit.GPIO6 = 1;
        temp = SpiaRegs.SPIRXBUF;

        SpiaRegs.SPIFFRX.bit.RXFFIL = 4;
        SPIenc_state = 2;
        GpioDataRegs.GPACLEAR.bit.GPIO4 = 1;
        SpiaRegs.SPITXBUF = ((unsigned)0x68)<<8;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        break;
    case 2:
        GpioDataRegs.GPASET.bit.GPIO4 = 1;
        GpioDataRegs.GPASET.bit.GPIO6 = 1;
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte2 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIbyte3 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIbyte4 = SpiaRegs.SPIRXBUF & 0xFF;
        //            SPIenc1_reading = (SPIbyte2<<24) | (SPIbyte3<<16) | (SPIbyte4<<8) | SPIbyte5;
        SPIenc1_reading =  ((SPIbyte2<<16) | (SPIbyte3<<8) | SPIbyte4)<<8;
        SPIenc1_reading = SPIenc1_reading >>8;
        SpiaRegs.SPIFFRX.bit.RXFFIL = 4;
        SPIenc_state = 3;
        GpioDataRegs.GPACLEAR.bit.GPIO6 = 1;
        SpiaRegs.SPITXBUF = ((unsigned)0x68)<<8;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        break;

    case 3:
        GpioDataRegs.GPASET.bit.GPIO4 = 1;
        GpioDataRegs.GPASET.bit.GPIO6 = 1;
        SPIenc_state = 30;
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte2 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIbyte3 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIbyte4 = SpiaRegs.SPIRXBUF & 0xFF;
        //            SPIenc2_reading = (SPIbyte2<<24) | (SPIbyte3<<16) | (SPIbyte4<<8) | SPIbyte5;
        SPIenc2_reading = ((SPIbyte2<<16) | (SPIbyte3<<8) | SPIbyte4)<<8;
        SPIenc2_reading = SPIenc2_reading>>8;
        //            SWI_post(&SWI_control);
        SpiaRegs.SPICCR.bit.SPICHAR      = 0xF;  // Set to transmit 16 bits
        SPI_Interrupt_Finished = 1;
        break;

    case 4:
        GpioDataRegs.GPASET.bit.GPIO19 = 1;                 //Pull CS high as done R/W
        for (i=0; i<4; i++) {
            readdata[i] = SpiaRegs.SPIRXBUF; // readdata[0] is garbage
        }
        AccelXraw = readdata[1];
        AccelYraw = readdata[2];
        AccelZraw = readdata[3];
        accelx = AccelXraw*4.0/32767.0;
        accely = AccelYraw*4.0/32767.0;
        accelz = AccelZraw*4.0/32767.0;


        SpiaRegs.SPIFFRX.bit.RXFFIL = 4;
        GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;

        SpiaRegs.SPITXBUF = ((0x8000)|(0x4200));
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SPIenc_state = 5;
        break;

    case 5:
        GpioDataRegs.GPASET.bit.GPIO19 = 1;                 //Pull CS high as done R/W
        for (i=0; i<4; i++) {
            readdata[i] = SpiaRegs.SPIRXBUF; // readdata[0] is garbage
        }
        gyroXraw = readdata[1];
        gyroYraw = readdata[2];
        gyroZraw = readdata[3];
        gyrox  = gyroXraw*250.0/32767.0;
        gyroy  = gyroYraw*250.0/32767.0;
        gyroz  = gyroZraw*250.0/32767.0;
        if(calibration_state == 0){
            calibration_count++;
            // SPI_Interrupt_Finished = 1;
            if (calibration_count == 2000) {
                calibration_state = 1;
                calibration_count = 0;
            }
            //        while(SpiaRegs.SPIFFRX.bit.RXFFST !=0){
            //            temp = SpiaRegs.SPIRXBUF;
            //        }
        } else if(calibration_state == 1){

            accelx_offset+=accelx;
            accely_offset+=accely;
            accelz_offset+=accelz;

