JFiore31/ME461_repo/C2000Ware_4_01_00_00/device_support/f2802x/f28027_ls7366/f28027_enc_and_imu.c
            gyrox_offset+=gyrox;
            gyroy_offset+=gyroy;
            gyroz_offset+=gyroz;
            // SPI_Interrupt_Finished = 1;

            calibration_count++;
            if (calibration_count == 2000) {
                calibration_state = 2;
                accelx_offset/=2000.0;
                accely_offset/=2000.0;
                accelz_offset/=2000.0;
                gyrox_offset/=2000.0;
                gyroy_offset/=2000.0;
                gyroz_offset/=2000.0;
                calibration_count = 0;
            }

        } else if(calibration_state == 2){
            accelx_cal = accelx - (accelx_offset);
            accely_cal = accely - (accely_offset);
            accelz_cal = accelz - (accelz_offset);

            gyrox_cal  = gyrox - gyrox_offset;
            gyroy_cal  = gyroy - gyroy_offset;
            gyroz_cal  = gyroz - gyroz_offset;
            StartKalman = 1;
            gyrox_kalman = gyrox_cal;
            gyroy_kalman = gyroy_cal;
            gyroz_kalman = gyroz_cal;
            accelx_kalman = accelx_cal;
            accely_kalman = accely_cal;
            accelz_kalman = accelz_cal;

        }


        start_7366SPI();

        break;

    }




    //    if (firstinSPI == 1 ) {
    //        firstinSPI = 0;
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=0){
        temp = SpiaRegs.SPIRXBUF;
    }
    //    }

    SpiaRegs.SPIFFRX.bit.RXFFOVFCLR=1;  // Clear Overflow flag
    SpiaRegs.SPIFFRX.bit.RXFFINTCLR=1;  // Clear Interrupt flag

    PieCtrlRegs.PIEACK.all = PIEACK_GROUP6;   // Acknowledge interrupt to PIE
    GpioDataRegs.GPACLEAR.bit.GPIO5 = 1;

}

//
// cpu_timer0_isr - 
//
__interrupt void cpu_timer0_isr(void)
{
    Timer0Count++;
    if (Timer0Count > 32000) { // Rolls over at 32767 so catch before that point
        Timer0Count = 0;
    }
    // GpioDataRegs.GPBTOGGLE.bit.GPIO34 = 1;
    UARTPrint = 1;
    //
    // Acknowledge this interrupt to receive more interrupts from group 1
    //
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;
}

//
// cpu_timer1_isr - 
//
__interrupt void cpu_timer1_isr(void)
{
    CpuTimer1.InterruptCount++;
    //    start_7366SPI();

    //start IMU
    if (SPI_Interrupt_Finished == 1) {
        SPI_Interrupt_Finished = 0;
        SpiaRegs.SPIFFRX.bit.RXFFIL = 4;

        GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;

        SpiaRegs.SPITXBUF = ((0x8000)|(0x3A00));
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SPIenc_state = 4;
    }
}

//
// cpu_timer2_isr - 
//
__interrupt void cpu_timer2_isr(void)
{  
    CpuTimer2.InterruptCount++;


}

// This function is called each time a char is recieved over UARTA.
void serialRXA(serial_t *s, char data) {
    numRXA ++;

}

//
// End of File
//
